generate more data + update readme
